{
    "Voiceless it cries, wingless flutters, toothless bites, mouthless mutters": "wind",
    "A box without hinges, key, or lid, yet golden treasure inside is hid": "egg",
    "Alive without breath, as cold as death; never thirsty, ever drinking, all in mail never clinking": "fish",
    "It cannot be seen, cannot be felt, cannot be heard, cannot be smelt. It lies behind stars and under hills, and empty holes it fills. It comes first and follows after, ends life, kills laughter": "darkness",
    "This thing all things devours: birds, beasts, trees, flowers; gnaws iron, bites steel; grinds hard stones to meal; slays king, ruins town, and beats high mountain down": "time",
    "Thirty white horses on a red hill, first they champ, then they stamp, then they stand still": "teeth",
    "An eye in a blue face saw an eye in a green face. \"That eye is like to this eye\" said the first eye, \"but in low place, not in high place\"": "the sun looking at a flower",
    "Tall I am young, short when I’m old, while I glow, life unfolds": "candle",
    "What has roots as nobody sees, is taller than trees, up, up it goes, and yet never grows?": "mountain",
    "No-legs lay on one-leg, two-legs sat near on three-legs, four-legs got some": "fish on table, man on stool, cat got some",
    "The more of me you take, the more you leave behind": "footsteps",
    "What comes once in a minute, twice in a moment, but never in a thousand years?": "the letter M",
    "The person who makes it, sells it. The person who buys it, never uses it. The person who uses it, never knows they're using it": "coffin",
    "What has a heart that doesn’t beat?": "artichoke",
    "What gets wetter the more it dries?": "towel",
    "What has many keys but can't open any doors?": "piano",
    "I am always hungry, I must always be fed. The finger I touch, will soon turn red": "fire",
    "I go up but never come down": "age",
    "The more you take away from me, the bigger I get": "hole",
    "What walks on four legs in the morning, two at noon, and three in the evening?": "man",
    "What has hands but cannot clap?": "clock",
    "I speak without a mouth and hear without ears. I have no body, but I come alive with wind": "echo",
    "I have cities, but no houses; mountains, but no trees; and water, but no fish": "map",
    "You see me in water, but I never get wet. What am I?": "reflection",
    "What flies forever, rests never?": "wind",
    "What can run but never walks, has a bed but never sleeps, has a mouth but never talks?": "river",
    "What belongs to you but others use it more than you do?": "your name",
    "I’m light as a feather, yet the strongest man can’t hold me for more than a minute": "breath",
    "Break me, and I do not stop working. Touch me, and I may be snared. What am I?": "heart",
    "What has an end but no beginning, a home but no family, a space but no room?": "envelope",
    "What has to be broken before you can use it?": "egg",
    "What comes down but never goes up?": "rain",
    "What can fill a room but takes up no space?": "light",
    "What begins and has no end, and is the key to every land?": "circle",
    "What runs around a yard without moving?": "fence",
    "What has one eye but cannot see?": "needle",
    "What begins with T, ends with T, and has T in it?": "teapot",
    "What has four wheels and flies?": "garbage truck",
    "What goes through towns and over hills but never moves?": "road",
    "What gets bigger the more you take away?": "hole",
    "What can’t be used until it’s broken?": "egg",
    "What has a neck but no head?": "bottle",
    "What can travel around the world while staying in a corner?": "stamp",
    "The more you take, the more you leave behind. What am I?": "footsteps",
    "What can you catch but not throw?": "cold",
    "What kind of room has no doors or windows?": "mushroom",
    "What goes up and down but doesn’t move?": "stairs",
    "What begins with an E, ends with an E, but only has one letter in it?": "envelope",
    "What has a bottom at the top?": "leg",
    "What comes once in a year, twice in a week, but never in a day?": "the letter E",
    "What’s full of holes but still holds water?": "sponge",
    "What kind of tree can you carry in your hand?": "palm",
    "What has words but never speaks?": "book",
    "What invention lets you look right through a wall?": "window",
    "What’s always in front of you but can’t be seen?": "the future",
    "What can you hold in your left hand but not in your right?": "your right hand",
    "What has 13 hearts but no other organs?": "deck of cards",
    "What runs but has no legs?": "faucet",
    "What has ears but cannot hear?": "corn",
    "What goes up but never comes down?": "age",
    "What is always coming, but never arrives?": "tomorrow",
    "What has a ring but no finger?": "telephone",
    "What starts with a P, ends with an E, and has thousands of letters?": "post office",
    "What has teeth but cannot bite?": "comb",
    "What has one head, one foot, and four legs?": "bed",
    "What can’t talk but will reply when spoken to?": "echo",
    "What can be cracked, made, told, and played?": "joke",
    "What is so fragile that saying its name breaks it?": "silence",
    "What kind of band never plays music?": "rubber band",
    "What building has the most stories?": "library",
    "What comes after thunder?": "lightning",
    "What has many rings but no fingers?": "tree",
    "What can fill your eyes but not your hands?": "dreams",
    "What’s invisible, yet you can feel it, and without it you die?": "air",
    "What sleeps in day and hunts at night, has feathers but cannot fly?": "owl",
    "What’s not alive, but grows; doesn't have lungs, but needs air; doesn't have a mouth, but water kills it?": "fire",
    "What goes through the forest but doesn’t touch a leaf?": "wind",
    "What walks without feet, talks without voice, touches you but can’t be touched?": "shadow",
    "You see a boat full of people. It has not sunk. But when you look again, there is not a single person on board": "they were all married",
    "What breathes but has no life?": "wind",
    "What has no legs but still can dance?": "flame",
    "What creeps without feet, whispers without voice, and consumes all in its path?": "time",
    "What sings but has no mouth, and weeps but sheds no tears?": "violin",
    "What waits for none, yet touches all?": "time",
    "What walks through walls and leaves no mark?": "thought",
    "What flies with no wings and strikes with no claws?": "arrow",
    "What builds up towers and breaks down mountains, yet is not seen?": "imagination",
    "What eats words and drinks silence?": "book",
    "What has a face and two hands but no arms or eyes?": "clock",
    "What cries in the dark and vanishes in light?": "shadow",
    "What feeds on fear but grows with courage?": "challenge",
    "What burns with no flame, chills with no frost, and weighs nothing?": "regret",
    "What is older than time, yet new every moment?": "memory",
    "What can be broken without a single touch?": "promise",
    "What can trap the mighty, free the meek, and lives on paper?": "word",
    "What sings from the branch and weeps at the fall?": "leaf",
    "What climbs without legs and falls without fear?": "smoke",
    "What wears armor made of glass and walks only when shattered?": "ice",
    "What moves faster when held tighter?": "sand",
    "What grows without water, shines without light, and dies when spoken?": "secret",
    "What cannot be held, cannot be weighed, but can drown you?": "emotion",
    "What has a voice and tells no lies, though its tales are twisted?": "mirror",
    "What flows yet has no source, turns yet has no wheel?": "time",
    "What runs on silver feet and sings in crystal tones?": "stream",
    "What slumbers in stone and wakes with heat?": "lava",
    "What dances in the sky and hides behind clouds?": "sun",
    "What can be bent but never broken, seen but never touched?": "light",
    "What can shatter steel and calm the beast, yet weighs nothing?": "song",
    "What opens all but closes none, reveals much but hides more?": "question",
    "What begins in darkness, ends in light, and lives in the mind?": "dream",
    "What turns without moving, and leads without speaking?": "compass",
    "What steals sight in day and hides stars at night?": "fog",
    "What binds without rope and cuts without blade?": "word",
    "What rides on the wind, dances on flame, and weeps in rain?": "smoke",
    "What can fill a cave but be carried in a palm?": "echo",
    "What cannot be seen or touched, yet makes the strongest tremble?": "fear",
    "What flies from lips, wounds like a blade, and cannot be unsaid?": "lie",
    "What sings in silence and lives in stillness?": "thought",
    "What hides in every shadow but vanishes in fire?": "darkness",
    "What has no home, no hearth, no kin, yet visits all unbidden?": "death",
    "What stretches endlessly, holds all, and is held by none?": "sky",
    "What devours all yet is never full?": "greed",
    "What rules over kings and beggars, yet cannot rule itself?": "gold",
    "What walks through fire and does not burn, yet trembles at the wind?": "courage",
    "What turns day to night without a touch?": "eclipse",
    "What drinks the sun and feeds the earth?": "tree",
    "What wanders forever, though it never moves?": "legend",
    "What binds the present to the past and foretells the future?": "story",
    "What is a road with no end, a path with no steps, a journey never taken?": "thought"
}